# Criando dataframes a partir de dicion√°rios
---

In [1]:
dicionario1 = {'col-a':range(1,7),
               'col-b':['A','B','C','D','E','F'],
               'col-c':[5,3,6,9,2,4]}

In [2]:
dicionario1['col-c'][0]

5

In [3]:
import pandas as pd

In [4]:
df1 = pd.DataFrame(dicionario1)

In [5]:
df1

   col-a col-b  col-c
0      1     A      5
1      2     B      3
2      3     C      6
3      4     D      9
4      5     E      2
5      6     F      4

In [6]:
dicionario2 = {'col-a':(1,2,3,5,6),
               'col-b':['A','B','C','E','F'],
               'col-d':[10,20,30,40,50]}

In [7]:
lista_indices = ['linha-1','linha-2','linha-3','linha-4','linha-5']

In [8]:
df2 = pd.DataFrame(dicionario2, index=lista_indices)

In [9]:
df2

         col-a col-b  col-d
linha-1      1     A     10
linha-2      2     B     20
linha-3      3     C     30
linha-4      5     E     40
linha-5      6     F     50

In [10]:
df3inner = pd.merge(df1,df2)

In [11]:
df3inner

   col-a col-b  col-c  col-d
0      1     A      5     10
1      2     B      3     20
2      3     C      6     30
3      5     E      2     40
4      6     F      4     50

In [12]:
df3outer = pd.merge(df1,df2,how='outer')

In [13]:
df3outer

   col-a col-b  col-c  col-d
0      1     A      5   10.0
1      2     B      3   20.0
2      3     C      6   30.0
3      4     D      9    NaN
4      5     E      2   40.0
5      6     F      4   50.0

In [14]:
df3left = pd.merge(df1,df2,how='left')

In [15]:
df3left

   col-a col-b  col-c  col-d
0      1     A      5   10.0
1      2     B      3   20.0
2      3     C      6   30.0
3      4     D      9    NaN
4      5     E      2   40.0
5      6     F      4   50.0

In [16]:
df3right = pd.merge(df1,df2,how='right')

In [17]:
df3right

   col-a col-b  col-c  col-d
0      1     A      5     10
1      2     B      3     20
2      3     C      6     30
3      5     E      2     40
4      6     F      4     50

In [18]:
dfona = pd.merge(df1,df2,on=('col-a'))

In [19]:
dfona

   col-a col-b_x  col-c col-b_y  col-d
0      1       A      5       A     10
1      2       B      3       B     20
2      3       C      6       C     30
3      5       E      2       E     40
4      6       F      4       F     50

In [20]:
dfonea = pd.merge(df1,df2,on=('col-c'))

KeyError: 'col-c'

In [23]:
dicionario1Rev = {'col-a':reversed(range(1,7)),
                  'col-b':['A','B','C','D','E','F'],
                  'col-c':[5,3,6,9,2,4]}

In [24]:
df1Rev = pd.DataFrame(dicionario1Rev)

In [26]:
df1Rev

   col-a col-b  col-c
0      6     A      5
1      5     B      3
2      4     C      6
3      3     D      9
4      2     E      2
5      1     F      4

In [27]:
dfcoincidentes1Rev = pd.merge(df1Rev,df2)

In [28]:
dfcoincidentes1Rev

Empty DataFrame
Columns: [col-a, col-b, col-c, col-d]
Index: []

In [29]:
dfcoincRevA = pd.merge(df1Rev,df2,on=('col-a'))

In [30]:
dfcoincRevA

   col-a col-b_x  col-c col-b_y  col-d
0      6       A      5       F     50
1      5       B      3       E     40
2      3       D      9       C     30
3      2       E      2       B     20
4      1       F      4       A     10

In [31]:
dfcoincRevB = pd.merge(df1Rev,df2,on=('col-b'))

In [32]:
dfcoincRevB

   col-a_x col-b  col-c  col-a_y  col-d
0        6     A      5        1     10
1        5     B      3        2     20
2        4     C      6        3     30
3        2     E      2        5     40
4        1     F      4        6     50

In [33]:
colaboradores = ({"Nome":['Alberto','Luiz','Carlos','Sandra','Ana','Maria'],
                 "Sobrenome":['Faria','Souza','Silva','Oliveira','Castro','Pereira'],
                 "IDCargo": [5,2,8,3,1,8],
                 "IDColaborador":[3,4,8,9,10,11]})

In [34]:
cargos = ({"IDCargo": [1,2,3,4,5,6,7,8],
           "Cargo": ['Diretoria Geral','Diretor Comercial','Diretor Financeiro','Gerente Operacional',
                     'Gerente Comercial','Coordenador','Analista','Vendedor']})

In [35]:
salarios = ({"Salario" : [1200.00,3800.00,1200.00,3800.00,8000.00,2000.00],
      "IDCargo" : [8,2,8,3,1,5],
      "IDColaborador" : [11,4,8,9,10,3]})

In [36]:
dfColaboradores = pd.DataFrame(colaboradores)

In [37]:
dfSalarios = pd.DataFrame(salarios)

In [38]:
dfCargos = pd.DataFrame(cargos)

In [39]:
dfSalariosColaboradores = pd.merge(dfColaboradores,dfSalarios)

In [43]:
dfSalariosColaboradores

      Nome Sobrenome  IDCargo  IDColaborador  Salario
0  Alberto     Faria        5              3   2000.0
1     Luiz     Souza        2              4   3800.0
2   Carlos     Silva        8              8   1200.0
3   Sandra  Oliveira        3              9   3800.0
4      Ana    Castro        1             10   8000.0
5    Maria   Pereira        8             11   1200.0

In [40]:
dfCargosSalariosColaboradores = pd.merge(dfSalariosColaboradores,dfCargos)

In [41]:
dfCargosSalariosColaboradores

      Nome Sobrenome  IDCargo  IDColaborador  Salario               Cargo
0  Alberto     Faria        5              3   2000.0   Gerente Comercial
1     Luiz     Souza        2              4   3800.0   Diretor Comercial
2   Carlos     Silva        8              8   1200.0            Vendedor
3    Maria   Pereira        8             11   1200.0            Vendedor
4   Sandra  Oliveira        3              9   3800.0  Diretor Financeiro
5      Ana    Castro        1             10   8000.0     Diretoria Geral

In [42]:
dfCargosSalariosColaboradores.describe()

        IDCargo  IDColaborador      Salario
count  6.000000       6.000000     6.000000
mean   4.500000       7.500000  3333.333333
std    3.016621       3.271085  2572.676946
min    1.000000       3.000000  1200.000000
25%    2.250000       5.000000  1400.000000
50%    4.000000       8.500000  2900.000000
75%    7.250000       9.750000  3800.000000
max    8.000000      11.000000  8000.000000